Repository: zhilchenko/uc_epay_kkb
Catalog: translations/*.po
Languages: ru

source: Credit card (epay.kkb.kz)
ru: Банковская карта (epay.kkb.kz)

source: Credit card
ru: Банковская карта

source: Redirect to epay.kkb.kz to pay by credit card.
ru: Перенаправляет на epay.kkb.kz для оплаты банковской картой.

source: Payment approved by epay.kkb.kz.
ru: Оплата подтверждена epay.kkb.kz.

source: Payment completing error. Bad response code (%code).
ru: Ошибка получения оплаты. Не верный код ответа (%code).

source: Payment URL
ru: URL оплаты

source: When you are ready to receive payments set URL to %live_url
ru: Когда будете готовы принимать платежи укажите %live_url

source: Completing URL
ru: URL подтверждения

source: Merchant information
ru: Информация о продавце

source: Merchant ID
ru: ID продавца

source: Merchant name
ru: Название продавца

source: Certificate serial number
ru: Серийный номер сертификата

source: Keys
ru: Ключи

source: Merchant private key password
ru: Пароль приватного ключа продавца

source: Payment completing
ru: Подтверждение платежа

source: Completing order status
ru: Статус заказа для подтверждения платежа

source: When order status will be equal to value of this element system make a payment completing request to gateway.
ru: Когда статус заказа будет равен значению этого элемента система сделает запрос к шлюзу на подтверждение оплаты.

source: Proceed payment
ru: Перейти к оплате

source: Payment receiving error for order %order_id. Bank signature don't match.
ru: Ошибка получения оплаты для заказа %order_id. Подпись банка не совпадает.

source: Payment receiving error for order %order_id. Bad response code (%code).
ru: Ошибка получения оплаты для заказа %order_id. Не верный код ответа (%code).

source: Customer used a different e-mail address during payment: %email
ru: Покупатель ввел другой адрес электронной почты при оплате: %email

source: Paid by epay.kkb.kz.
ru: Оплачено через epay.kkb.kz.

source: Shipping
ru: Доставка

source: uc_epay_kkb was unable to create directory %directory. Please, create it by hand.
ru: uc_epay_kkb не удалось создать каталог %directory. Пожалуйста, создайте его вручную.

source: Please create a .htaccess file in your %directory directory which contains the following lines: <code>%htaccess</code> or add them to the existing .htaccess file
ru: Пожалуйста создайте файл .htaccess в каталоге %directory со следующим содержимым: <code>%htaccess</code> или добавьте его в существующий файл

source: uc_epay_kkb was unable to write a test text file to the destination directory %directory, and is therefore unable to check the security of it.
ru: uc_epay_kkb не удалось записать тестовый текстовый файл в каталог %directory и поэтому невозможно проверить его безопасность.

source: uc_epay_kkb certificate directory is publicly accessible. Please secure the '%directory' directory
ru: uc_epay_kkb: каталог сертификата доступен для всех. Пожалуйста, обеспечте безопасность каталога %directory

source: Receiving payment notification for order %order_id, but order not found.
ru: Получение платежа для заказа %order_id, но заказ не найден.

source: Receiving payment notification for order %order_id.
ru: Получение платежа для заказа %order_id.

source: Error private key loading: %error
ru: Ошибка загрузки приватного ключа: %error

source: Error public key loading: %error
ru: Ошибка загрузки публичного ключа: %error

source: Error signature verifying: %error
ru: Ошибка подтверждения подписи: %error

source: uc_epay_kkb was unable to find bank public key %cert. Please, place it in %dir.
ru: uc_epay_kkb не удалось найти публичный ключ банка %cert. Пожалуйста, поместите его в %dir.

source: uc_epay_kkb was unable to find private merchant key %cert. Please, place it in %dir.
ru: uc_epay_kkb не удалось найти приватный ключ продавца %cert. Пожалуйста, поместите его в %dir.

source: Order payment
ru: Оплата заказа

source: Order complete
ru: Заказ завершен

source: Enabled
ru: Включено

source: Not found
ru: Не нейдено

source: uc_epay_kkb requires <a href='!openssl_url'>OpenSSL</a>.
ru: uc_epay_kkb требует <a href='!openssl_url'>OpenSSL</a>.

source: uc_epay_kkb requires <a href='!simplexml_url'>SimpleXML</a>.
ru: uc_epay_kkb требует <a href='!simplexml_url'>SimpleXML</a>.

source: ePay from KKB
ru: ePay от ККБ

source: Process payments using ePay.kkb.kz.
ru: Прием платежей используя ePay.kkb.kz

source: Ubercart - payment
ru: Ubercart - оплата

source: Error public key loading:
ru: Ошибка загрузки публичного ключа:

source: Error signature verifying:
ru: Ошибка подтверждения подписи:
